tap "brewforge/chinese"
tap "brewforge/extras"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "biome"
brew "bottom"
brew "chsrc"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "graphviz2drawio"
brew "hyperfine"
brew "jq"
brew "kondo"
brew "lazygit"
brew "lsd"
brew "node"
brew "mailsy"
brew "micromamba"
brew "nomino"
brew "ollama"
brew "openjdk"
brew "ouch"
brew "oxipng"
brew "pandoc"
brew "pdfcpu"
brew "pueue"
brew "ripgrep"
brew "ripgrep-all"
brew "sniffnet"
brew "starship"
brew "subversion"
brew "tlrc"
brew "typst"
brew "typstyle"
brew "wthrr"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gromgit/fuse/ntfs-3g-mac"
cask "adrive"
cask "baidunetdisk"
cask "blackhole-2ch"
cask "buzz"
cask "clash-verge-rev"
cask "douyin"
cask "ecopaste"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "gopeed"
cask "i4tools"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "localsend"
cask "lulu"
cask "macfuse"
cask "mounty"
cask "obs-cn"
cask "openmtp"
cask "oversight"
cask "pdfsam-basic"
cask "pearcleaner"
cask "peazip"
cask "pot-desktop"
cask "qq"
cask "quickrecorder"
cask "shotcut"
cask "stretchly"
cask "tencent-meeting"
cask "viber"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wpsoffice-cn"
cask "xnviewmp"
cask "zoom"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "czhang03.unicode-math-input"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.workspace-formatter"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jeronimoekerdt.color-picker-universal"
vscode "kirozen.wordcounter"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.python"
vscode "myriad-dreamin.tinymist"
vscode "pepri.subtitles-editor"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "streetsidesoftware.code-spell-checker-ukrainian"
vscode "takumii.markdowntable"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zjffun.snippetsmanager"
