tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "ivaquero/chinese"
brew "bat"
brew "bottom"
brew "clang-format"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "gitui"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "lsd"
brew "node"
brew "openjdk"
brew "ouch"
brew "pandoc"
brew "pueue"
brew "ripgrep"
brew "rustup-init"
brew "starship"
brew "tealdeer"
brew "tectonic"
brew "tokei"
brew "typst"
brew "uutils-coreutils"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "ivaquero/chinese/bbdown"
cask "adrive"
cask "android-file-transfer"
cask "baidunetdisk"
cask "bitwarden"
cask "blackhole-2ch"
cask "chatgpt"
cask "clash-verge"
cask "crystalfetch"
cask "dingtalk"
cask "douyin"
cask "drawio"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "gimp-cn"
cask "google-chrome"
cask "keepingyouawake"
cask "licecap"
cask "lulu"
cask "mambaforge-cn"
cask "motrix"
cask "musescore"
cask "obs-cn"
cask "oversight"
cask "pdfsam-basic"
cask "peazip"
cask "qq"
cask "rectangle"
cask "shotcut"
cask "tencent-meeting"
cask "tor-browser"
cask "trex"
cask "utm"
cask "viber"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wpsoffice"
cask "xnviewmp"
cask "zoom"
cask "zotero"
vscode "AntiAntiSepticeye.vscode-color-picker"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "ChrisChinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "clover.md-table-editor"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.workspace-formatter"
vscode "GrapeCity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "inu1255.easy-snippet"
vscode "James-Yu.latex-workshop"
vscode "JannisX11.batch-rename-extension"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mgt19937.typst-preview"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-python.black-formatter"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "nvarner.typst-lsp"
vscode "oijaz.unicode-latex"
vscode "pepri.subtitles-editor"
vscode "PeterSchmalfeldt.explorer-exclude"
vscode "PKief.material-icon-theme"
vscode "pomdtr.markdown-kroki"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-ukrainian"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "xaver.clang-format"
vscode "yinfei.luahelper"
vscode "YuTengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zhangxiaoqian.emoji-intellisense"
